socialNetwork/runs/e2e-compose-post-1-bc7f/output.txt
Running 30s test @ http://localhost:8080/wrk2-api/post/compose
  4 threads and 64 connections

  Thread calibration: mean lat.: 16.084ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 15.692ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 16.025ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 15.910ms, rate sampling interval: 47ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.97ms    6.22ms  38.91ms   82.17%
    Req/Sec   252.98     75.85   446.00     68.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.30ms
 75.000%   17.87ms
 90.000%   23.82ms
 99.000%   38.91ms
 99.900%   56.26ms
 99.990%   72.89ms
 99.999%   74.88ms
100.000%   74.88ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.175     0.000000            1         1.00
      10.591     0.100000         2009         1.11
      11.671     0.200000         4020         1.25
      12.519     0.300000         6018         1.43
      13.375     0.400000         8025         1.67
      14.295     0.500000        10038         2.00
      14.783     0.550000        11021         2.22
      15.351     0.600000        12027         2.50
      16.007     0.650000        13025         2.86
      16.815     0.700000        14026         3.33
      17.871     0.750000        15029         4.00
      18.511     0.775000        15534         4.44
      19.215     0.800000        16025         5.00
      20.079     0.825000        16530         5.71
      21.135     0.850000        17027         6.67
      22.351     0.875000        17528         8.00
      23.039     0.887500        17777         8.89
      23.823     0.900000        18028        10.00
      24.591     0.912500        18279        11.43
      25.631     0.925000        18529        13.33
      26.751     0.937500        18779        16.00
      27.439     0.943750        18904        17.78
      28.191     0.950000        19031        20.00
      28.991     0.956250        19155        22.86
      29.983     0.962500        19278        26.67
      31.167     0.968750        19405        32.00
      31.743     0.971875        19466        35.56
      32.591     0.975000        19529        40.00
      33.311     0.978125        19591        45.71
      34.463     0.981250        19656        53.33
      35.647     0.984375        19717        64.00
      36.319     0.985938        19748        71.11
      37.407     0.987500        19782        80.00
      38.335     0.989062        19812        91.43
      39.231     0.990625        19843       106.67
      40.735     0.992188        19873       128.00
      41.727     0.992969        19889       142.22
      42.751     0.993750        19905       160.00
      43.871     0.994531        19921       182.86
      45.247     0.995313        19936       213.33
      46.559     0.996094        19951       256.00
      47.711     0.996484        19959       284.44
      48.511     0.996875        19967       320.00
      50.271     0.997266        19975       365.71
      51.359     0.997656        19984       426.67
      51.935     0.998047        19990       512.00
      52.799     0.998242        19994       568.89
      53.023     0.998437        19998       640.00
      54.719     0.998633        20002       731.43
      55.487     0.998828        20006       853.33
      56.479     0.999023        20010      1024.00
      56.607     0.999121        20012      1137.78
      57.087     0.999219        20014      1280.00
      58.527     0.999316        20016      1462.86
      59.103     0.999414        20018      1706.67
      64.543     0.999512        20020      2048.00
      64.639     0.999561        20021      2275.56
      66.623     0.999609        20022      2560.00
      69.311     0.999658        20023      2925.71
      70.143     0.999707        20024      3413.33
      70.655     0.999756        20025      4096.00
      70.655     0.999780        20025      4551.11
      71.871     0.999805        20026      5120.00
      71.871     0.999829        20026      5851.43
      72.895     0.999854        20027      6826.67
      72.895     0.999878        20027      8192.00
      72.895     0.999890        20027      9102.22
      73.983     0.999902        20028     10240.00
      73.983     0.999915        20028     11702.86
      73.983     0.999927        20028     13653.33
      73.983     0.999939        20028     16384.00
      73.983     0.999945        20028     18204.44
      74.879     0.999951        20029     20480.00
      74.879     1.000000        20029          inf
#[Mean    =       15.975, StdDeviation   =        6.219]
#[Max     =       74.816, Total count    =        20029]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29681 requests in 30.00s, 6.09MB read
  Non-2xx or 3xx responses: 30
Requests/sec:    989.27  
Transfer/sec:    207.75KB